Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 5
      name: Warm-up phase
    - duration: 60
      arrivalRate: 20
      rampTo: 100
      name: Baseline load test (100 Virtual Users)
    - duration: 30
      arrivalRate: 200
      name: Stress spike phase
  defaults:
    headers:
      content-type: "application/json"

scenarios:
  - name: "API Health & Focus AI Flow"
    flow:
      - get:
          url: "/api/health"
      - post:
          url: "/api/planner/generate"
          json:
            task: "Performance Audit Execution"
            availableTimeMinutes: 60
